yunsmall/usbipdcpp_esp32/components/usbipdcpp/src/esp32_handler/Esp32DeviceHandler.cpp
#include "esp32_handler/Esp32DeviceHandler.h"

#include <algorithm>
#include <esp_log.h>

#include "usbipdcpp/Session.h"
#include "usbipdcpp/protocol.h"
#include "usbipdcpp/SetupPacket.h"
#include "usbipdcpp/constant.h"
#include "usbipdcpp/Endpoint.h"
#include "usbipdcpp/utils/LatencyTracker.h"

const char *usbipdcpp::Esp32DeviceHandler::TAG = "Esp32DeviceHandler";

usbipdcpp::Esp32DeviceHandler::Esp32DeviceHandler(UsbDevice &handle_device, usb_device_handle_t native_handle,
                                                  usb_host_client_handle_t host_client_handle) :
    AbstDeviceHandler(handle_device, std::make_unique<Esp32TransferOperator>()),
    native_handle(native_handle), host_client_handle(host_client_handle),
    transfer_operator_(static_cast<Esp32TransferOperator *>(get_transfer_operator())) {
    ESP_ERROR_CHECK(usb_host_device_info(native_handle, &device_info));
}

usbipdcpp::Esp32DeviceHandler::~Esp32DeviceHandler() = default;

namespace {

void log_heap_diag(const char *tag) {
    SPDLOG_INFO("{} heap: free={}, min_free={}, dma_free={}, dma_max_block={}, psram_free={}, psram_max_block={}", tag,
                esp_get_free_heap_size(), esp_get_minimum_free_heap_size(),
                heap_caps_get_free_size(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL),
                heap_caps_get_largest_free_block(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL),
                heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
                heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM));
}

} // anonymous namespace

void usbipdcpp::Esp32DeviceHandler::on_new_connection(TransferResponder &responder, error_code &ec) {
    AbstDeviceHandler::on_new_connection(responder, ec);
    all_transfer_should_stop = false;
    device_removed_ = false;
    log_heap_diag(TAG);

    // 构建端点 MPS 查找表
    transfer_operator_->endpoint_mps_map_.clear();
    for (const auto &intf: handle_device.interfaces) {
        for (const auto &ep: intf.current_endpoints()) {
            transfer_operator_->endpoint_mps_map_[ep.address] = ep.max_packet_size;
        }
    }
    // 控制端点 0 的 MPS
    if (handle_device.ep0_in.max_packet_size > 0) {
        transfer_operator_->endpoint_mps_map_[0x80] = handle_device.ep0_in.max_packet_size;
    }
    if (handle_device.ep0_out.max_packet_size > 0) {
        transfer_operator_->endpoint_mps_map_[0x00] = handle_device.ep0_out.max_packet_size;
    }
    for (const auto &[addr, mps]: transfer_operator_->endpoint_mps_map_) {
        SPDLOG_INFO("endpoint mps: addr={:02x}, mps={}", addr, mps);
    }
}

void usbipdcpp::Esp32DeviceHandler::on_disconnection(error_code &ec) {
    all_transfer_should_stop = true;

    if (device_removed_) [[unlikely]] {
        // 设备已移除：usbh 已对设备全部端点做 HALT_FLUSH，所有传输回调已
        // 入队（在 client 事件线程排队执行），无需再 cancel——设备 gone 后
        // halt/flush/clear 无意义且可能对失效句柄报错。
        // 但必须等待计数归零再返回：device_removed_ 也可能被 NO_DEVICE 状态
        // 的传输回调提前置位（该回调只是事件队列中的第一个，其余端点回调
        // 可能尚未执行），若直接返回，session 收尾会立即销毁 handler，未
        // 执行的回调访问 handler 即 UAF。等待必然结束：usbh 已 flush 全部
        // URB，回调最终都会执行并递减计数（DEV_GONE 路径下回调先于
        // DEV_GONE 消息执行完毕——usbh_process 动作顺序 EPn_HALT_FLUSH 先于
        // PROP_GONE_EVT，usb_host_client_handle_events 每轮先 _handle_pending_ep
        // 派发回调再处理事件消息队列，依据 ESP-IDF v5.5 usb 组件源码）
        SPDLOG_WARN("设备已移除，等待全部传输回调完成");
        {
            std::unique_lock lock(transfer_complete_mutex_);
            transfer_complete_cv_.wait(lock, [this]() {
                return pending_count_ == 0;
            });
        }
        AbstDeviceHandler::on_disconnection(ec);
        return;
    }

    // 取消所有端点的传输（遍历实际端点，不依赖 tracker 快照）。
    // 控制端点（ep0）无法在此单独取消：usbh_ep_get_handle 只认接口端点表，
    // 对 ep0 返回 ESP_ERR_NOT_FOUND。挂起的控制传输会在设备正常响应/STALL
    // 后回调，回调走 all_transfer_should_stop 分支收尾递减计数，不会让下方
    // 等待永久阻塞；设备已移除的场景由上面的提前返回分支覆盖。
    // 注意：ESP-IDF v5.5 无传输超时机制（usb_transfer_t.timeout_ms 注释明确
    // "currently not supported yet"，usbh/usb_host 无超时逻辑），若设备永久
    // 无响应（硬件故障/恶意设备），挂起的控制传输既不回调也无法取消，下方
    // 等待会永久阻塞——这是框架限制，此层无法解决
    for (const auto &intf: handle_device.interfaces) {
        for (const auto &ep: intf.current_endpoints()) {
            cancel_endpoint_all_transfers(ep.address);
        }
    }

    // 等待所有传输完成
    {
        std::unique_lock lock(transfer_complete_mutex_);
        transfer_complete_cv_.wait(lock, [this]() {
            return pending_count_ == 0;
        });
    }

    // Note: callback_args_pool_ is intentionally NOT cleared here. ObjectPool::clear()
    // permanently destroys all preallocated slots and there is no re-init path, so
    // clearing on session disconnect would force every subsequent alloc() in a
    // following session to fall back to heap `new`, defeating the purpose of the pool.
    // The pool's lifetime matches the handler's; its destructor releases the slots.
    AbstDeviceHandler::on_disconnection(ec);
}

void usbipdcpp::Esp32DeviceHandler::handle_unlink_seqnum(std::uint32_t unlink_seqnum, std::uint32_t cmd_seqnum) {
    if (device_removed_) [[unlikely]]
            return;
    SPDLOG_INFO("handle_unlink_seqnum unlink_seqnum:{},cmd_seqnum:{}", unlink_seqnum, cmd_seqnum);

    bool found = false;

    // 非分块传输
    if (!found) {
        std::unique_lock lock(transfers_mutex_);
        auto it = transfers_.find(unlink_seqnum);
        if (it != transfers_.end()) {
            auto *cb = it->second;
            cb->unlinked = true;
            cb->unlink_cmd_seqnum = cmd_seqnum;
            found = true;
            // 锁内先保存端点地址再解锁：解锁后 transfer_callback 可能拿锁完成
            // 传输（erase + 释放 trx + 归还 cb），再读 cb->transfer 就是 UAF
            auto ep_addr = static_cast<usb_transfer_t *>(cb->transfer.get())->bEndpointAddress;
            lock.unlock();
            cancel_endpoint_all_transfers(ep_addr);
        }
    }

    if (!found) {
        // 不在任何表中——传输已完成（回调已发 RET_SUBMIT 或 RET_UNLINK）。
        // 此时 CMD_UNLINK 已无意义，直接同步发 RET_UNLINK(0)。
        SPDLOG_DEBUG("transfer {} 已不在传输表中，立即发送 ret_unlink {}", unlink_seqnum, cmd_seqnum);
        responder->submit_ret_unlink(
                UsbIpResponse::UsbIpRetUnlink::create_ret_unlink(cmd_seqnum, 0));
    }
}

void usbipdcpp::Esp32DeviceHandler::receive_urb(
        UsbIpCommand::UsbIpCmdSubmit cmd,
        UsbEndpoint ep,
        std::optional<UsbInterface> interface,
        usbipdcpp::error_code &ec) {

    if (device_removed_) [[unlikely]] {
        ec = make_error_code(ErrorType::NO_DEVICE);
        return;
    }

    auto seqnum = cmd.header.seqnum;
    auto transfer_flags = cmd.transfer_flags;
    auto transfer_buffer_length = cmd.transfer_buffer_length;
    const auto &setup_packet = cmd.setup;
    bool is_control = (ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Control));

