yunsmall/usbipdcpp_esp32/components/usbipdcpp/src/esp32_handler/Esp32DeviceHandler.cpp
    // 控制传输：特殊请求处理 + 非控制传输需要接口
    if (is_control) [[unlikely]] {
        auto tweak_ret = tweak_special_requests(setup_packet);
        if (tweak_ret >= 0) {
            // tweak_ret == 0：tweak 成功（CLEAR_FEATURE 已同步完成、SET_INTERFACE
            // alt=0 无需操作），回复成功
            // tweak_ret > 0：tweak 失败（esp 错误码，如 set_interface alt!=0
            // 不支持、clear_halt 失败），不能回复成功——客户端会误以为操作
            // 已生效，按 EPIPE 回复让客户端感知失败
            if (tweak_ret == 0) {
                responder->submit_ret_submit(
                        UsbIpResponse::UsbIpRetSubmit::create_ret_submit_ok_without_data(seqnum, transfer_buffer_length));
            }
            else {
                SPDLOG_ERROR("tweak 特殊控制请求失败：seqnum={}, err={}", seqnum,
                             esp_err_to_name(static_cast<esp_err_t>(tweak_ret)));
                responder->submit_ret_submit(
                        UsbIpResponse::UsbIpRetSubmit::create_ret_submit_epipe_without_data(seqnum, 0));
            }
            return;
        }
    }
    else if (!interface.has_value()) [[unlikely]] {
        SPDLOG_ERROR("非控制传输却不存在目标接口");
        ec = make_error_code(ErrorType::INTERNAL_ERROR);
        return;
    }

    bool is_out = is_control ? setup_packet.is_out() : !ep.is_in();

    // num_bytes 和 MPS 对齐
    std::uint32_t num_bytes;
    if (is_control) {
        // 恶意 wLength 大于 transfer_buffer_length 时 num_bytes 会超过分配的
        // 缓冲区大小，但不会越界：提交路径（usb_host_transfer_submit_control
        // → usbh_dev_submit_ctrl_urb、usb_host_transfer_submit →
        // usbh_ep_enqueue_urb）入口都无条件调 urb_check_args（usbh.c:245）
        // 检查 num_bytes <= data_buffer_size，超了返回 ESP_ERR_INVALID_ARG，
        // 进不到 hcd_urb_enqueue 就不会碰数据缓冲区，走下方失败路径回 EPIPE
        num_bytes = USB_SETUP_PACKET_SIZE + setup_packet.length;
    }
    else {
        num_bytes = transfer_buffer_length;
        // ISO 跳过 MPS 对齐：usbh 的 transfer_check_usb_compliance 要求 ISO
        // 的 num_bytes 精确等于各包 num_bytes 之和（依据 ESP-IDF v5.5
        // usbh.c），对齐会使提交失败（ESP_ERR_INVALID_ARG）
        if (!is_out && ep.max_packet_size > 0
            && ep.attributes != static_cast<std::uint8_t>(EndpointAttributes::Isochronous)) {
            std::uint32_t mps = ep.max_packet_size;
            if (num_bytes % mps != 0) {
                if (ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Bulk))
                    num_bytes = ((num_bytes + mps - 1) / mps) * mps;
                else
                    num_bytes = ((num_bytes / mps) + 1) * mps;
            }
        }
    }

    auto *trx = static_cast<usb_transfer_t *>(cmd.transfer.get());

    // 填充 setup packet 到 buffer 开头
    // OUT 数据已经被 from_socket 写到 buffer + USB_SETUP_PACKET_SIZE 位置
    if (is_control) {
        auto *setup_pkt = reinterpret_cast<usb_setup_packet_t *>(trx->data_buffer);
        setup_pkt->bmRequestType = setup_packet.request_type;
        setup_pkt->bRequest = setup_packet.request;
        setup_pkt->wValue = setup_packet.value;
        setup_pkt->wIndex = setup_packet.index;
        setup_pkt->wLength = setup_packet.length;
    }

    auto *callback_args = callback_args_pool_.alloc();
    if (!callback_args) [[unlikely]] {
        callback_args = new esp32_callback_args{};
    }
    callback_args->handler = this;
    callback_args->seqnum = seqnum;
    callback_args->is_out = is_out;
    callback_args->original_transfer_buffer_length = transfer_buffer_length;
    callback_args->transfer = std::move(cmd.transfer);
    // 池对象复用时重置旧值，防止回调误用上一个 session 的状态
    callback_args->unlinked = false;
    callback_args->unlink_cmd_seqnum = 0;

    trx->device_handle = native_handle;
    trx->callback = transfer_callback;
    trx->context = callback_args;
    trx->bEndpointAddress = ep.address;
    trx->num_bytes = num_bytes;
    trx->flags = get_esp32_transfer_flags(transfer_flags);

    // 类型特有处理
    if (is_control) {
        callback_args->transfer_type = USB_TRANSFER_TYPE_CTRL;
        SPDLOG_DEBUG("控制传输 {}，ep addr: {:02x}", is_out?"Out":"In", ep.address);
    }
    else if (ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Bulk)) [[likely]] {
        callback_args->transfer_type = USB_TRANSFER_TYPE_BULK;
        if (is_out) {
            // On bulk OUT, USB_TRANSFER_FLAG_ZERO_PACK asks the host to append a
            // zero-length packet when the payload is an exact multiple of the
            // endpoint MPS, so the device sees a clean end-of-transfer marker.
            trx->flags |= USB_TRANSFER_FLAG_ZERO_PACK;
        }
        SPDLOG_DEBUG("块传输 {}，ep addr: {:02x}, len: {}, num_bytes: {}",
                     is_out?"Out":"In", ep.address, transfer_buffer_length, num_bytes);
    }
    else if (ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Interrupt)) {
        callback_args->transfer_type = USB_TRANSFER_TYPE_INTR;
        SPDLOG_DEBUG("中断传输 {}，ep addr: {:02x}, len: {}, num_bytes: {}",
                     is_out?"Out":"In", ep.address, transfer_buffer_length, num_bytes);
    }
    else if (ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Isochronous)) {
        callback_args->transfer_type = USB_TRANSFER_TYPE_ISOCHRONOUS;
        SPDLOG_DEBUG("同步传输 {}，ep addr: {:02x}", is_out?"Out":"In", ep.address);
        // iso_packet_descriptors 已通过 set_iso_descriptor 设置到 trx 中
    }
    else [[unlikely]] {
        SPDLOG_ERROR("端口{:02x}的未知传输类型：{}", ep.address, ep.attributes);
        // 清理已分配的资源再返回：callback_args 已从池分配（或 new），
        // transfer 所有权已转移至 callback_args->transfer，不清理则池槽位
        // 与 usb_transfer_t 同时泄漏（与重复 seqnum / 提交失败路径一致）
        callback_args->transfer.reset();
        callback_args->reset();
        if (!callback_args_pool_.free(callback_args)) {
            delete callback_args;
        }
        ec = make_error_code(ErrorType::INVALID_ARG);
        return;
    }

    // 注册到传输表。拒绝重复 seqnum（参照 LibusbDeviceHandler）：transfers_
    // 以 seqnum 为 key，重复会让两个在途传输共用一个 entry，erase/取消
    // 语义错乱（RET_SUBMIT 与 RET_UNLINK 可能乱序），旧条目还会泄漏。
    // 协议要求 seqnum 单调递增（内核 vhci 原子递增），重复属客户端违规。
    // 本次传输不提交给设备，按 EPIPE 回复
    {
        std::unique_lock lock(transfers_mutex_);
        if (transfers_.contains(seqnum)) [[unlikely]] {
            lock.unlock();
            callback_args->transfer.reset();
            callback_args->reset();
            if (!callback_args_pool_.free(callback_args)) {
                delete callback_args;
            }
            responder->submit_ret_submit(
                    UsbIpResponse::UsbIpRetSubmit::create_ret_submit_epipe_without_data(seqnum, 0));
            return;
        }
        transfers_.emplace(seqnum, callback_args);
        pending_count_.fetch_add(1, std::memory_order_release);
    }

    SPDLOG_DEBUG("submit seqnum={} {} {}", seqnum,
                 is_control ? "ctrl" :
                 ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Bulk) ? "bulk" :
                 ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Interrupt) ? "intr" : "iso",
                 is_out ? "out" : "in");
    LATENCY_TRACK(*responder->latency_tracker(), seqnum,
                  "Esp32DeviceHandler::receive_urb submit");
    esp_err_t err;
    if (is_control)
        err = usb_host_transfer_submit_control(host_client_handle, trx);
    else
        err = usb_host_transfer_submit(trx);

    if (err != ESP_OK) [[unlikely]] {
        SPDLOG_ERROR("传输失败：seqnum={}, ep={:02x}, type={}, {}, err={}",
                     seqnum, ep.address,
                     is_control ? "ctrl" :
                     ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Bulk) ? "bulk" :
                     ep.attributes == static_cast<std::uint8_t>(EndpointAttributes::Interrupt) ? "intr" : "iso",
                     is_out ? "out" : "in",
                     esp_err_to_name(err));
        // 提交失败路径无需检查 cb->unlinked 改发 RET_UNLINK：receive_urb 与
        // handle_unlink_seqnum 同在 Session receiver 线程串行执行（Session.cpp
        // 的接收循环），CMD_UNLINK 不可能在本路径执行中途置位；unlink 先到时
        // seqnum 尚未注册进 transfers_，handle_unlink 会发 RET_UNLINK(0) 兜底
        {
            std::unique_lock lock(transfers_mutex_);
            transfers_.erase(seqnum);
            // 只递减不通知：receive_urb 与 on_disconnection 同在 receiver 线程，
            // 本路径的递减必然先于等待的谓词检查执行，无需 notify 也不会丢失
            // 唤醒（参考 LibusbDeviceHandler 的同类注释）
            pending_count_.fetch_sub(1, std::memory_order_release);
        }
        callback_args->transfer.reset();
        callback_args->reset();
        if (!callback_args_pool_.free(callback_args)) {
            delete callback_args;
        }
        if (err == ESP_ERR_NOT_FOUND) [[unlikely]] {
            device_removed_ = true;
            ec = make_error_code(ErrorType::NO_DEVICE);
        }
        responder->submit_ret_submit(
                UsbIpResponse::UsbIpRetSubmit::create_ret_submit_epipe_without_data(seqnum, 0));
    }
}

void usbipdcpp::Esp32DeviceHandler::cancel_all_transfer() {
    // usb_parse_interface_descriptor 的第二参数是接口在配置描述符中的索引
    // （合法用法），此函数只用于定位端点描述符并取消端点
    // （cancel_endpoint_all_transfers 按端点地址操作），不涉及
    // claim/release 的 bInterfaceNumber 语义
    const usb_config_desc_t *config_desc;
    ESP_ERROR_CHECK(usb_host_get_active_config_descriptor(native_handle, &config_desc));
    const usb_intf_desc_t *intf = NULL;
    for (int i = 0; i < config_desc->bNumInterfaces; i++) {
        int intf_offset;
        intf = usb_parse_interface_descriptor(config_desc, i, 0, &intf_offset);
        if (!intf)
            continue;

        for (int j = 0; j < intf->bNumEndpoints; j++) {
            int endpoint_offset = intf_offset;
            const usb_ep_desc_t *ep = usb_parse_endpoint_descriptor_by_index(
                    intf, j, config_desc->wTotalLength, &endpoint_offset);
            if (!ep)
                continue;
            cancel_endpoint_all_transfers(ep->bEndpointAddress);
        }
    }
}

void usbipdcpp::Esp32DeviceHandler::cancel_endpoint_all_transfers(uint8_t bEndpointAddress) {
    // 持锁调用 halt/flush/clear 不会死锁：三者都是异步入队动作
    // （usb_host_endpoint_halt/flush/clear 内部只是 usbh_ep_command 把
    // USBH_EP_CMD_* 发给 usbh_process 处理，依据 ESP-IDF v5.5 usb_host.c），
    // 不等待传输回调执行；回调线程（client_event_thread）最多阻塞到本函数
    // 释放锁（微秒级），随后可正常拿共享锁重提交
    std::lock_guard lock(endpoint_cancellation_mutex);
    esp_err_t err;
    err = usb_host_endpoint_halt(native_handle, bEndpointAddress);
    if (err != ESP_OK) {
        SPDLOG_ERROR("usb_host_endpoint_halt address {} failed: {}", bEndpointAddress, esp_err_to_name(err));
    }
    err = usb_host_endpoint_flush(native_handle, bEndpointAddress);
    if (err != ESP_OK) {
        SPDLOG_ERROR("usb_host_endpoint_flush address {} failed: {}", bEndpointAddress, esp_err_to_name(err));
    }
    err = usb_host_endpoint_clear(native_handle, bEndpointAddress);
    if (err != ESP_OK) {
        SPDLOG_ERROR("usb_host_endpoint_clear address {} failed: {}", bEndpointAddress, esp_err_to_name(err));
    }
}

esp_err_t usbipdcpp::Esp32DeviceHandler::sync_control_transfer(const SetupPacket &setup_packet) const {
    usb_transfer_t *transfer = nullptr;
    auto err = usb_host_transfer_alloc(USB_SETUP_PACKET_SIZE, 0, &transfer);
    {
        if (err != ESP_OK) {
            SPDLOG_ERROR("无法申请transfer");
            goto error_occurred;
        }
        auto setup_pkt = reinterpret_cast<usb_setup_packet_t *>(transfer->data_buffer);

