yunsmall/usbipdcpp_esp32/components/usbipdcpp/src/esp32_handler/Esp32DeviceHandler.cpp
    SPDLOG_DEBUG("callback seqnum={} status={} actual={}", cb->seqnum,
                 static_cast<int>(trx->status), trx->actual_num_bytes);
    LATENCY_TRACK(*handler->responder->latency_tracker(), cb->seqnum,
                  "Esp32DeviceHandler::transfer_callback调用");

    // 如果断连了，直接清理并返回（不发送响应）
    if (handler->all_transfer_should_stop) [[unlikely]] {
        {
            std::unique_lock lock(handler->transfers_mutex_);
            handler->transfers_.erase(cb->seqnum);
        }
        cb->transfer.reset();
        cb->reset();
        if (!handler->callback_args_pool_.free(cb))
            delete cb;
        // 递减放最后：本分支对 handler 的所有访问已结束。若提前递减，
        // on_disconnection（receiver 线程）的等待立即返回，设备移除场景
        // 下 handler 随即被销毁，本分支后续访问 handler 即 UAF
        // （见本函数末尾的完整注释）
        handler->decrement_pending_and_notify();
        return;
    }

    // 持有 transfers_mutex_ 进行 CANCELED 判断，使判断与重提交之间原子化，
    // 防止 handle_unlink_seqnum 在判断与重提交之间设置 unlinked 并取消端点。
    // 入队（enqueue_ret_submit/unlink）也必须在锁内：并发完成的两个回调按拿锁
    // 顺序入队，响应顺序与完成顺序一致；锁外入队时后完成者可能先拿锁先入队，
    // 客户端看到完成顺序颠倒。锁内入队只是 vector push_back，成本极低，
    // wakeup_sender 已在锁外
    {
        std::unique_lock lock(handler->transfers_mutex_);

        // status 检查
        switch (trx->status) {
            case USB_TRANSFER_STATUS_COMPLETED:
                break;
            case USB_TRANSFER_STATUS_ERROR:
                SPDLOG_ERROR("transfer error on endpoint {}", trx->bEndpointAddress);
                break;
            case USB_TRANSFER_STATUS_CANCELED: {
                // ESP32 取消端点时会连带取消该端点所有 transfer
                // 未被标记 unlinked 的需要重新提交（持有 transfers_mutex_，与 handle_unlink_seqnum 互斥）
                if (!cb->unlinked) {
                    // 无需重置 actual_num_bytes / isoc 包 actual_num_bytes：
                    // hcd 在取消完成时统一清零（hcd_dwc.c 的 _buffer_parse_error
                    // 与 flush 路径都对被取消的 URB 写 actual_num_bytes = 0，
                    // ISO 包同样清零），CANCELED 回调读到的必为 0；重提交
                    // 完成后由 hcd 写入新值
                    trx->status = USB_TRANSFER_STATUS_COMPLETED;
                    esp_err_t err = ESP_OK;
                    bool stopping = false;
                    {
                        std::shared_lock ep_lock(handler->endpoint_cancellation_mutex);
                        // 断连检查与重提交必须在同一临界区：on_disconnection 先置
                        // all_transfer_should_stop 再取消端点（cancel_endpoint_all_transfers
                        // 持 endpoint_cancellation_mutex 排他锁）。若此处不检查直接重提交，
                        // 且提交发生在该端点取消完成之后，重提交的传输将无人取消
                        // （断连流程不会回头），回调不再到来，pending_count_ 永不归零，
                        // on_disconnection 永久阻塞。临界区保证：cancel 拿到排他锁前
                        // 完成的提交必然被其 flush；置位后进入本临界区的提交被拦下
                        if (handler->all_transfer_should_stop) {
                            stopping = true;
                        }
                        else if (cb->transfer_type == USB_TRANSFER_TYPE_CTRL) {
                            err = usb_host_transfer_submit_control(handler->host_client_handle, trx);
                        }
                        else {
                            err = usb_host_transfer_submit(trx);
                        }
                    }
                    if (stopping) {
                        // 断连中：与函数开头的 all_transfer_should_stop 分支相同，
                        // 只清理不发送响应
                        handler->transfers_.erase(cb->seqnum);
                        lock.unlock();
                        cb->transfer.reset();
                        cb->reset();
                        if (!handler->callback_args_pool_.free(cb))
                            delete cb;
                        // 递减放最后（见本函数末尾的完整注释）
                        handler->decrement_pending_and_notify();
                        return;
                    }
                    if (err != ESP_OK) {
                        SPDLOG_ERROR("seqnum为{}的传输重新提交失败：{}", cb->seqnum, esp_err_to_name(err));
                        handler->transfers_.erase(cb->seqnum);
                        lock.unlock();
                        handler->responder->submit_ret_submit(
                                UsbIpResponse::UsbIpRetSubmit::create_ret_submit_epipe_without_data(cb->seqnum, 0));
                        cb->transfer.reset();
                        cb->reset();
                        if (!handler->callback_args_pool_.free(cb))
                            delete cb;
                        // 递减放最后（见本函数末尾的完整注释）
                        handler->decrement_pending_and_notify();
                    }
                    return;
                }
                SPDLOG_INFO("transfer seqnum {} canceled on endpoint {}", cb->seqnum, trx->bEndpointAddress);
                break;
            }
            case USB_TRANSFER_STATUS_STALL:
                SPDLOG_ERROR("endpoint {} is stalled", trx->bEndpointAddress);
                break;
            case USB_TRANSFER_STATUS_NO_DEVICE:
                handler->device_removed_ = true;
                SPDLOG_INFO("device removed?");
                break;
            default:
                SPDLOG_WARN("urb completion with unknown status {}", static_cast<int>(trx->status));
                break;
        }

        SPDLOG_DEBUG("esp32传输了{}个字节", trx->actual_num_bytes);

        // 计算 actual_length
        std::uint32_t actual_length = trx->actual_num_bytes;
        bool is_control = (trx->bEndpointAddress & 0x7F) == 0;
        if (!cb->is_out && is_control) {
            if (actual_length > USB_SETUP_PACKET_SIZE)
                actual_length -= USB_SETUP_PACKET_SIZE;
            else
                actual_length = 0;
        }
        if (trx->num_isoc_packets > 0 && !cb->is_out) {
            std::uint32_t iso_actual = 0;
            for (int i = 0; i < trx->num_isoc_packets; i++)
                iso_actual += trx->isoc_packet_desc[i].actual_num_bytes;
            actual_length = iso_actual;
        }

        // 统计 ISO 传输中失败的包数（协议 RET_SUBMIT 的 error_count 字段；
        // 内核 stub 由 USB 核心统计后填充，此处统计非 COMPLETED 的包等价）
        std::uint32_t error_count = 0;
        if (cb->transfer_type == USB_TRANSFER_TYPE_ISOCHRONOUS) [[unlikely]] {
            for (int i = 0; i < trx->num_isoc_packets; i++) {
                if (trx->isoc_packet_desc[i].status != USB_TRANSFER_STATUS_COMPLETED)
                    error_count++;
            }
        }

        // 从 map 移除（与 handle_unlink_seqnum 互斥）。
        // 递减不在此处：必须放到本函数末尾（见函数末尾的完整注释）
        handler->transfers_.erase(cb->seqnum);

        if (cb->unlinked) {
            LATENCY_TRACK_END_MSG(*handler->responder->latency_tracker(), cb->unlink_cmd_seqnum, "被unlink");
            handler->responder->enqueue_ret_unlink(
                    UsbIpResponse::UsbIpRetUnlink::create_ret_unlink(
                            cb->unlink_cmd_seqnum, trxstat2error(trx->status)));
            cb->transfer.reset();
        }
        else {
            UsbIpResponse::UsbIpRetSubmit ret;
            if (cb->is_out) {
                if (cb->transfer_type == USB_TRANSFER_TYPE_ISOCHRONOUS) [[unlikely]] {
                    // ISO OUT：转移所有权给响应，由 send_transfer_data 发送描述符
                    // （OUT 方向不发送数据，见 Esp32TransferOperator::send_transfer_data）。
                    // 协议要求 ISO 不分方向都返回 number_of_packets 个描述符，且
                    // 描述符 actual_length 之和必须等于 header 的 actual_length
                    ret = UsbIpResponse::UsbIpRetSubmit::create_ret_submit(
                            cb->seqnum, trxstat2error(trx->status), actual_length,
                            0, trx->num_isoc_packets, std::move(cb->transfer));
                }
                else {
                    ret = UsbIpResponse::UsbIpRetSubmit::create_ret_submit_with_status_and_no_data(
                            cb->seqnum, trxstat2error(trx->status), actual_length);
                    cb->transfer.reset();
                }
            }
            else {
                ret = UsbIpResponse::UsbIpRetSubmit::create_ret_submit(
                        cb->seqnum, trxstat2error(trx->status),
                        actual_length, 0, trx->num_isoc_packets,
                        std::move(cb->transfer));
            }
            ret.error_count = error_count;
            SPDLOG_DEBUG("esp32传输actual_length为{}个字节", actual_length);
            LATENCY_TRACK(*handler->responder->latency_tracker(), cb->seqnum,
                          "Esp32DeviceHandler::transfer_callback submit_ret_submit");
            handler->responder->enqueue_ret_submit(std::move(ret));
        }
    }
    handler->responder->wakeup_sender();

    cb->reset();
    if (!handler->callback_args_pool_.free(cb))
        delete cb;

    // 递减与唤醒必须放在本函数末尾（本函数对 handler 的最后一次访问）：
    // 一旦计数归零并 notify，on_disconnection（receiver 线程）的等待即返回，
    // 设备移除场景下 session 收尾会立刻销毁 handler（设备从 using 列表 erase）。
    // 若提前递减，等待者返回后本函数仍在访问 handler（wakeup_sender /
    // callback_args_pool_ / cv），与 handler 析构并发
    // 即 UAF。放末尾保证等待者被唤醒时本回调已执行完毕；正常断连场景设备
    // 回 available 列表、handler 存活，此顺序同样无害
    handler->decrement_pending_and_notify();
}
